Управление_торговлей.ПБТ/src/Enums/СтатусРезультатаИсследований/СтатусРезультатаИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусРезультатаИсследований</name>
  <enumValues>
    <name>соответствует</name>
  </enumValues>
  <enumValues>
    <name>несоответствует</name>
  </enumValues>
  <enumValues>
    <name>брак</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяДополнительноеИсследование</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяВыводСотрудникаЦПБ</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Enums/ВариантыСравнения/ВариантыСравнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыСравнения</name>
  <enumValues>
    <name>ВИнтервале</name>
  </enumValues>
  <enumValues>
    <name>Между</name>
  </enumValues>
  <enumValues>
    <name>НеБолее</name>
  </enumValues>
  <enumValues>
    <name>НеМенее</name>
  </enumValues>
  <enumValues>
    <name>Менее</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>EPCGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>RFIDМеткаНеЧитаемая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Catalogs/ВидыСырья/ВидыСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСырья</name>
  <comment>Аналоги номенклатуры, являющейся сырьем</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойАналог</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСнабжения</name>
    <type>
      <types>CatalogRef.ГруппыСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Тара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Неликвид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетСвидетельство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕКод</name>
    <type>
      <types>CatalogRef.КлассификаторЕКодов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АналогиСырья</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Победитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БазисыПоставки</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазисПоставки</name>
      <type>
        <types>CatalogRef.БазисПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПрочиеРасходы</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/CommonModules/пбт_ПроизводствоСервер/Module.bsl
Функция ЭтоЧисло(Слово) Экспорт
	
	Цифры = "1234567890.,";
	
	Для НомСимвола = 1 По СтрДлина(Слово) Цикл
		
		Если Найти(Цифры, Сред(Слово, НомСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина
	
КонецФункции

Функция НайтиСоздатьСерию(Номер, Номенклатура, Производитель = Неопределено, ДатаИзготовления = Неопределено, ГоденДо = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	//|	СерииНоменклатуры.бит_Номенклатура = &Номенклатура
	|	 СерииНоменклатуры.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Номер", Номер);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Серия = Выборка.Ссылка;
	Иначе
		СерияОб = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияОб.Номер = Номер;
		//СерияОб.бит_Номенклатура = Номенклатура;
		//СерияОб.бит_Производитель = Производитель;
		//СерияОб.бит_ДатаПроизводства = ДатаИзготовления;
		СерияОб.ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
		СерияОб.ДатаПроизводства = ДатаИзготовления;
		СерияОб.ГоденДо = ГоденДо;
		СерияОб.Записать();
		Серия = СерияОб.Ссылка;
	КонецЕсли;   
	
	Возврат Серия;
	
КонецФункции // ()
 
Функция гл_ОбразецСоответствуетНормативам_ВЛаборатории(парам_ПротоколАнализа, парам_СписокПоказателей = "", ТЧ, ТЗНесоответствий=Неопределено) Экспорт
	лСписокПоказателейНесоответствия = Новый СписокЗначений;
	лРезультат = Истина;
	
	//создаем структуру ТЗНесоответствий
	Если ТипЗнч(ТЧ) = Тип("ТаблицаЗначений") Тогда
		ТЗНесоответствий = ТЧ.Скопировать();
	Иначе		
		ТЗНесоответствий = ТЧ.Выгрузить();
	КонецЕсли;
	ТЗНесоответствий.Очистить();
	ТЗНесоответствий.Колонки.Добавить("НормативноеЗначение");
	
	Для каждого лСтрокаТЧПоказатели Из ТЧ Цикл
		лЗначениеФакт = лСтрокаТЧПоказатели.Значение;
		лИнтервал = "";
		лВариантСравнения = "";
		
		лДопустимоеОтклонение = "";
		лЗначениеНорматива = Лаборатория_Сервер.гл_ПолучитьЗначениеНорматива(парам_ПротоколАнализа.Номенклатура, парам_ПротоколАнализа.ВидИсследования, лСтрокаТЧПоказатели.Показатель, лВариантСравнения, лИнтервал,,,парам_ПротоколАнализа.Дата, лДопустимоеОтклонение);
		
		//27.11.2018 потому что должны брать данные из документа
		лВариантСравнения = лСтрокаТЧПоказатели.ВариантСравнения;
		лЗначениеНорматива = лСтрокаТЧПоказатели.ЗначениеПоТУ;
		
		//Если НЕ лЗначениеНорматива = "" Тогда 
		Если ЗначениеЗаполнено(лЗначениеНорматива) Тогда 
			//Значение норматива не пустое
			
			Если (ТипЗНЧ(лЗначениеНорматива) = Тип("Число")) ИЛИ (ТипЗНЧ(лЗначениеНорматива) = Тип("Дата")) Тогда
				//устанавливаем по умолчанию
				лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует;
				//если отклоение не число - то ставим его равным 0
				Если НЕ ЗначениеЗаполнено(лДопустимоеОтклонение) Тогда
				    лДопустимоеОтклонение = 0;
				КонецЕсли; 
				Если НЕ ТипЗнч(лДопустимоеОтклонение) = Тип("Число") Тогда
					лДопустимоеОтклонение = 0;
				КонецЕсли;
				
				//brava погрешности
				Если лДопустимоеОтклонение = 0 Тогда
				    лДопустимоеОтклонение = лСтрокаТЧПоказатели.Погрешность;
				КонецЕсли; 
				
				//Сравнение числовых значений и дат
				Если ЗначениеЗаполнено(лВариантСравнения) Тогда
					Если лВариантСравнения = Перечисления.ВариантыСравнения.НеБолее Тогда
						//Меньше или равно
						//лЗначениеНорматива = лЗначениеНорматива + лДопустимоеОтклонение;
						Если НЕ лЗначениеФакт <= лЗначениеНорматива +лДопустимоеОтклонение Тогда
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
						Иначе
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если лЗначениеФакт > лЗначениеНорматива - лДопустимоеОтклонение Тогда
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "";
							КонецЕсли;
						КонецЕсли; 
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.Менее Тогда //0019391
						//Меньше
						//лЗначениеНорматива = лЗначениеНорматива + лДопустимоеОтклонение;
						Если НЕ лЗначениеФакт < лЗначениеНорматива +лДопустимоеОтклонение Тогда
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
						Иначе
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если лЗначениеФакт > лЗначениеНорматива - лДопустимоеОтклонение Тогда
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "";
							КонецЕсли;
						КонецЕсли; 
						
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.НеМенее Тогда 
						//лЗначениеНорматива = лЗначениеНорматива - лДопустимоеОтклонение;
						//Больше или равно
						Если НЕ лЗначениеФакт >= лЗначениеНорматива - лДопустимоеОтклонение Тогда
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
						Иначе
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если лЗначениеФакт < лЗначениеНорматива + лДопустимоеОтклонение Тогда
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "";
							КонецЕсли;
						КонецЕсли; 
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.ВИнтервале Тогда 
						//В интервале (плюс-минус)
						Если (лЗначениеФакт >= лЗначениеНорматива - лИнтервал - лДопустимоеОтклонение) И (лЗначениеФакт <= лЗначениеНорматива + лИнтервал+лДопустимоеОтклонение) Тогда
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если (лЗначениеФакт >= лЗначениеНорматива - лИнтервал) И (лЗначениеФакт <= лЗначениеНорматива + лИнтервал) Тогда
								лСтрокаТЧПоказатели.Комментарий = "";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							КонецЕсли;
						Иначе	
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
						КонецЕсли; 
					ИначеЕсли лВариантСравнения = Перечисления.ВариантыСравнения.Между Тогда 
						//В интервале (от и до)
						Если (лЗначениеФакт >= лЗначениеНорматива - лДопустимоеОтклонение) И (лЗначениеФакт <= лИнтервал + лДопустимоеОтклонение) Тогда
							//инц 0015149 brava
							//в нормативе, но только по погрешности
							Если (лЗначениеФакт >= лЗначениеНорматива) И (лЗначениеФакт <= лИнтервал) Тогда
								лСтрокаТЧПоказатели.Комментарий = "";
							Иначе
								лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
							КонецЕсли;
						Иначе	
							//Значение не соответствует нормативному
							лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
							лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
							лСтрокаТЧПоказатели.Комментарий = "";
							ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
						КонецЕсли; 
					КонецЕсли; 
					
				Иначе
					//если вариант не выбран - то статус не заполяем с 27.11.2018 brava
					//закоментировал 29.11.2018 потому что статус может быть проставлен ЦИРом
					Если парам_ПротоколАнализа.Заявка = Ложь Тогда
						лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.ПустаяСсылка();
					КонецЕсли; 
					

					////Вариант сравнения - РАВНО
					////Если НЕ лЗначениеФакт = лЗначениеНорматива Тогда
					////из-за отклонения даже равно становится интервалом
					//Если (лЗначениеФакт >= лЗначениеНорматива + лДопустимоеОтклонение) И (лЗначениеФакт <= лИнтервал - лДопустимоеОтклонение) Тогда
					//	//Значение не соответствует нормативному
					//	лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
					//	лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
					//	лСтрокаТЧПоказатели.Комментарий = "";
					//	ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива);
					//Иначе
					//	//инц 0015149 brava
					//	//в нормативе, но только по погрешности
					//	Если НЕ лЗначениеФакт = лЗначениеНорматива Тогда
					//		лСтрокаТЧПоказатели.Комментарий = "Входит в погрешность метода";
					//	Иначе
					//		лСтрокаТЧПоказатели.Комментарий = "";
					//	КонецЕсли;
					//КонецЕсли; 
				КонецЕсли; 
			ИначеЕсли ТипЗНЧ(лЗначениеНорматива) = Тип("Строка") Тогда
				//brava
				Если лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует Тогда
					Продолжить;
				КонецЕсли;
				лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует;
				//brava
				//Строки сравниваются по равенству, либо по соответствию Не допускается = Отсутствует (-ют)
				Если Найти(НРЕГ(лЗначениеНорматива), "не допуска") Тогда
					Если (Найти(НРЕГ(лЗначениеФакт), "отсутству") = 0) И (НЕ НРЕГ(СОКРЛП(лЗначениеФакт)) = НРЕГ(СОКРЛП(лЗначениеНорматива))
						// олег
						И (Найти(НРЕГ(лЗначениеФакт), "не обнаружен") = 0)
						// олег
						
						) Тогда
						//Значение не соответствует нормативному
						лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
						лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
						ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
					КонецЕсли;
				ИначеЕсли Найти(НРЕГ(лЗначениеФакт), "не соответству") Тогда
					лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
					лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
					ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
				ИначеЕсли Найти(НРЕГ(лЗначениеФакт), "соответству") Тогда
					//Значение соответствует нормативному
				Иначе
					Если НЕ НРЕГ(СОКРЛП(лЗначениеФакт)) = НРЕГ(СОКРЛП(лЗначениеНорматива)) Тогда
						//Значение не соответствует нормативному
						лСписокПоказателейНесоответствия.Добавить(лСтрокаТЧПоказатели.Показатель);
						лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
						ДобавитьСтрВТЗНесоотв(лСтрокаТЧПоказатели, ТЗНесоответствий, лЗначениеНорматива)
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
		Иначе
			//закоментировал 29.11.2018 потому что статус может быть проставлен ЦИРом
			Если парам_ПротоколАнализа.Заявка = Ложь Тогда
				лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если лСписокПоказателейНесоответствия.Количество() > 0 Тогда
		лРезультат = Ложь;
		парам_СписокПоказателей = лСписокПоказателейНесоответствия;	
	КонецЕсли; 
	
	Возврат лРезультат;
КонецФункции

Процедура ДобавитьСтрВТЗНесоотв(СтрТЧ, ТЗНесоотв, НормативноеЗначение)

	НовСтрТЗНесоотв = ТЗНесоотв.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтрТЗНесоотв, СтрТЧ);
	НовСтрТЗНесоотв.НормативноеЗначение = НормативноеЗначение;

КонецПроцедуры

Функция ПолучитьСписокАналогов(ВидСырья) Экспорт
	
	СЗ = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(ВидСырья) Тогда
		Возврат СЗ;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВидыСырьяАналогиСырья.Аналог КАК Аналог
	               |ИЗ
	               |	Справочник.ВидыСырья.АналогиСырья КАК ВидыСырьяАналогиСырья
	               |ГДЕ
	               |	ВидыСырьяАналогиСырья.Ссылка = &ВС";
	
	Запрос.УстановитьПараметр("ВС", ВидСырья);
	
	Мас = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Аналог");
	СЗ.ЗагрузитьЗначения(Мас);
	
	Возврат СЗ;
	
КонецФункции // ()
